
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13114679825)


<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.homepage
  * cloudflare_dns_record.homepage__www
  * cloudflare_pages_domain.clov3r-cc
  * cloudflare_pages_domain.www-clov3r-cc
* Update
  * cloudflare_zero_trust_access_application.pxmx01-mng


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.homepage will be created
  + resource "cloudflare_dns_record" "homepage" {
      + comment             = "for my homepage in Cloudflare Pages"
      + comment_modified_on = (known after apply)
      + content             = "my-home.pages.dev"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "clov3r.cc"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_dns_record.homepage__www will be created
  + resource "cloudflare_dns_record" "homepage__www" {
      + comment             = "for my homepage in Cloudflare Pages"
      + comment_modified_on = (known after apply)
      + content             = "my-home.pages.dev"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "www"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_pages_domain.clov3r-cc will be created
  + resource "cloudflare_pages_domain" "clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_pages_domain.www-clov3r-cc will be created
  + resource "cloudflare_pages_domain" "www-clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "www.clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_zero_trust_access_application.pxmx01-mng will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "pxmx01-mng" {
      ~ aud                          = "266eda25f2b9f34e528ee7458afff68d42cd07634efdbf698fff091742637218" -> (known after apply)
      + cors_headers                 = (known after apply)
      ~ created_at                   = "2025-02-03T13:19:57Z" -> (known after apply)
      ~ destinations                 = [] -> (known after apply)
      ~ footer_links                 = [] -> (known after apply)
        id                           = "4ca75f55-64bf-47f2-9fd9-d8fb3c22e0bf"
      + landing_page_design          = (known after apply)
        name                         = "Access application for pxmx01-mng"
      ~ policies                     = [
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = "f6f52920-2898-4fa1-a364-decfa742562e"
              + include          = (known after apply)
              + precedence       = 0
              + require          = (known after apply)
            },
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = "24688b5e-f084-4bc2-8671-1fa1c380bb24"
              + include          = (known after apply)
              + precedence       = 1
              + require          = (known after apply)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      ~ target_criteria              = [] -> (known after apply)
      ~ updated_at                   = "2025-02-03T13:20:31Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Warning: Resource not found

  with cloudflare_pages_domain.clov3r-cc,
  on my_homepage.tf line 20, in resource "cloudflare_pages_domain" "clov3r-cc":
  20: resource "cloudflare_pages_domain" "clov3r-cc" {

The resource was not found on the server and will be removed from state.

(and 3 more similar warnings elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Resource not found

  with cloudflare_pages_domain.clov3r-cc,
  on my_homepage.tf line 20, in resource "cloudflare_pages_domain" "clov3r-cc":
  20: resource "cloudflare_pages_domain" "clov3r-cc" {

The resource was not found on the server and will be removed from state.

(and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":71,"Program":"tfcmt","SHA1":"6a75285ed4fff4f7e2790e70ddbe6e6193b30310","Vars":{},"WorkflowName":"Terraform CI"} -->